---
kind: type
id: T:Autodesk.Revit.DB.ZoomType
source: html/4576d9a5-03d1-20d3-ff76-8224c8cccb49.htm
---
# Autodesk.Revit.DB.ZoomType

An enumerated type listing all Zoom types of Print Setting.

## Syntax (C#)
```csharp
public enum ZoomType
```